#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

	Перем СообщениеТелеграммБоту; // СообщениеТелеграммБоту до записи объекта в базу  

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверить табличную часть на предмет заполнения выполненных работ.
	// На основании полученных данных установить статус заявки
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ОжидаетсяВыполненияРабот;
	Иначе
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ЗаявкаЗаполнена;
	КонецЕсли;	
	
	СообщениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     	
     	Возврат;
     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда 
		СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.BKM_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграммБоту ) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьЗаполнениеОбъекта(Отказ); 
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	//отказ проведения, если не установлен процент оплаты работы для сотрудника
	ПроцентОплатыСотруднику = ПолучитьПроцентОплатыОтРабот(Дата, Специалист);
	Если ПроцентОплатыСотруднику = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Документ не проведен. Сотруднику %1 не установлен процент оплаты от выполненных работ", Специалист);
		Сообщение.Сообщить();
		Отказ = Истина
	КонецЕсли;
	
	
	// Движения по документу
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста) КАК СтоимостьЧасаРаботыСпециалиста
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Выполненныеработа = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	
	
	Пока Выборка.Следующий()цикл
	СуммакОпалте = Выполненныеработа * Выборка.СтоимостьЧасаРаботыСпециалиста; 
		// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выполненныеработа;
		Движение.СуммаКОплате = СуммакОпалте;


		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		Движение.СуммаКОплате = СуммакОпалте * ПроцентОплатыСотруднику/100;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.BKM_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.BKM_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор );
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		// Проверка вида договора
	
		Если Выборка.ВидДоговора  <>  Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание   Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ не проведен. Для данного вида докуемнтов используется только вид договора ""абонентское обслуживание"".";
			Сообщение.Сообщить();
			Отказ = Истина;
			
		ИначеЕсли Выборка.ДатаНачалаДействияДоговора > ДатаПроведенияРабот Или Выборка.ДатаОкончанияДействияДоговора < ДатаПроведенияРабот Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ не проведен. Дата проведения работ по документу не соответствует сроку действия договора.";
			Сообщение.Сообщить();
			Отказ = Истина
		КонецЕсли;  
	 Конецесли;		
КонецПроцедуры

Функция ПолучитьПроцентОплатыОтРабот(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";

	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот
	Иначе 
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка на обслуживание клиента";
		
	Иначе
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
						|Контрагент %3.
						|Дата проведения работ запланирована на %4 с %5 по %6.
						|Назначен специалист: %7.",
						ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), Специалист);
		
	КонецЕсли;
	
    Возврат ТекстСообщения; 
	
КонецФункции

#КонецОбласти

#КонецЕсли