#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьЗаполнениеОбъекта(Отказ); 
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	//отказ проведения, если не установлен процент оплаты работы для сотрудника
	ПроцентОплатыСотруднику = ПроцентОплатыСотруднику(Дата, Специалист);
	Если ПроцентОплатыСотруднику = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Документ не проведен. Сотруднику %1 не установлен процент оплаты от выполненных работ", Специалист);
		Сообщение.Сообщить();
		Отказ = Истина
	КонецЕсли;
	
	
	// Движения по документу
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста) КАК СтоимостьЧасаРаботыСпециалиста
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Выполненныеработа = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	
	
	Пока Выборка.Следующий()цикл
	СуммакОпалте = Выполненныеработа * Выборка.СтоимостьЧасаРаботыСпециалиста; 
		// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выполненныеработа;
		Движение.СуммаКОплате = СуммакОпалте;


		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		Движение.СуммаКОплате = СуммакОпалте * ПроцентОплатыСотруднику/100;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_КонецДействияДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор );
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		// Проверка вида договора
	
		Если Выборка.ВидДоговора  <>  Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание   Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ не проведен. Для данного вида докуемнтов используется только вид договора ""абонентское обслуживание"".";
			Сообщение.Сообщить();
			Отказ = Истина;
			
		ИначеЕсли Выборка.ВКМ_НачалоДействияДоговора > ДатаПроведенияРабот Или Выборка.ВКМ_КонецДействияДоговора < ДатаПроведенияРабот Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ не проведен. Дата проведения работ по документу не соответствует сроку действия договора.";
			Сообщение.Сообщить();
			Отказ = Истина
		КонецЕсли;  
	 Конецесли;		
КонецПроцедуры

Функция ПроцентОплатыСотруднику(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот
	Иначе 
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли