#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(ГрафикРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед заполнением укажите график работ.",,"ГрафикРабот");
		Возврат;
	Конецесли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Корректно заполните период заполнения графика работ.",,"Период");
		Возврат;
	Конецесли;			
	
	ЗаполнитьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка заполнения графика завершена.");
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафики(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДниПоДнямНедели, ГрафикРабот);	

	
КонецПроцедуры
#КонецОбласти

