#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьГруппаПоДоговору()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидимостьГруппаПоДоговору();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьГруппаПоДоговору()
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаПоДоговору.Видимость = Истина
	Иначе
		Элементы.ГруппаПоДоговору.Видимость = Ложь
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
